HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_s12ad_rx/src/r_s12ad_rx.c
/***********************************************************************************************************************
* Copyright (c) 2013 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_s12ad_rx.c
* Description  : Primary source code for 12-bit A/D Converter driver.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           22.07.2013 1.00    Initial Release.
*           21.04.2014 1.20    Updated for RX210 advanced features; RX110/63x support.
*           06.11.2014 1.40    Added RX113 support.
*           01.03.2016 2.11    Added RX130 and RX230 support.
*           01.10.2016 2.20    Added RX65x support.
*                              Corresponding to the notice for A/D convert stop.(RX110/RX111/RX113/RX210/RX63x)
*                              Corresponding to the notice for shift to Low power mode.(RX110/RX111/RX113/RX210/RX63x)
*                              Delete parameter check by the enum value.
*                              R_ADC_ReadAll() parameter change.(adjust the parameter structure to RX130/RX230/RX231)
*                              Bug fix for callback function execute when pointer is NULL.(RX130/RX230/RX231)
*                              TEMPS register can change only during temperature sensor mode.(RX63x/RX210)
*           03.09.2018 3.00    Added RX66T support.
*                              Added the comment to while statement.
*           28.12.2018 3.10    Added RX72T support.
*           05.04.2019 4.00    Added support for GNUC and ICCRX.
*                              Deleted the process of RX210, RX631, and RX63N.
*                              Deleted the function of adc_gbadi_isr.
*           28.06.2019 4.10    Added RX23W support.
*           31.07.2019 4.20    Added RX72M support.
*           30.08.2019 4.30    Added RX13T support.
*           22.11.2019 4.40    Added RX66N and RX72N support.
*                              Added support for atomic control.
*           28.02.2020 4.50    Added RX23E-A support.
*                              Added the following processing to fix the bug.
*                              - Added the process of read the A/D Data Duplication Register (ADDBLDR) to the 
*                                R_ADC_ReadAll function.
*                              - Added the interrupt function of A/D scan end interrupt for Group B.
*           10.06.2020 4.60    Added RX23T and RX24T and RX24U support.
*           01.09.2020 4.80    Added RX671 support.
*           30.07.2021 4.90    Added RX140 support.
*           29.12.2021 5.00    Added RX660 support.
*           01.08.2022 5.10    Added RX26T support.
*           14.10.2022 5.20    Added RX23E-B support.
*           03.04.2023 5.30    Added RX26T 48k support.
*           13.02.2024 5.40    Added RX260 and RX261 support.
*           20.03.2025 5.41    Changed the disclaimer in program sources.
*           13.07.2025 5.50    Added RX14T support.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include "platform.h"
/* Configuration for this package. */
#include "r_s12ad_rx_config.h"
/* Public interface header file for this package. */
#include "r_s12ad_rx_if.h"
/* Private header file for this package. */
#include "r_s12ad_rx_private.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
#if (defined(BSP_MCU_RX64M)   || defined(BSP_MCU_RX65_ALL) || defined(BSP_MCU_RX66T) \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72T)    || defined(BSP_MCU_RX72M) \
    || defined(BSP_MCU_RX66N) || defined(BSP_MCU_RX72N)    || defined(BSP_MCU_RX24T) \
    || defined(BSP_MCU_RX24U) || defined(BSP_MCU_RX671)    || defined(BSP_MCU_RX26T) \
    || defined(BSP_MCU_RX14T))
/* In ROM */
extern R_BSP_VOLATILE_EVENACCESS uint16_t * const  gp_dreg0_ptrs[];
extern R_BSP_VOLATILE_EVENACCESS uint16_t * const  gp_dreg1_ptrs[];
#if (defined(BSP_MCU_RX66T)   || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX24T) \
    || defined(BSP_MCU_RX24U) || defined(BSP_MCU_RX26T))
extern R_BSP_VOLATILE_EVENACCESS uint16_t * const  gp_dreg2_ptrs[];
#endif

#elif defined(BSP_MCU_RX660)

extern R_BSP_VOLATILE_EVENACCESS uint16_t * const  gp_dreg_ptrs[];

#else  /* rx110/rx111/rx113/rx130/rx13t/rx140/rx230/rx231/rx23w/rx23e-a/rx23e-b/rx23t/rx260/rx261 */

extern R_BSP_VOLATILE_EVENACCESS uint16_t * const  gp_dreg_ptrs[]; // In ROM
adc_ctrl_t g_dcb = { ADC_MODE_MAX, false, NULL};  // In RAM

#endif /* #if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65_ALL) || defined(BSP_MCU_RX66T) \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72T)    || defined(BSP_MCU_RX72M) \
    || defined(BSP_MCU_RX66N) || defined(BSP_MCU_RX72N)    || defined(BSP_MCU_RX24T) \
    || defined(BSP_MCU_RX24U) || defined(BSP_MCU_RX671)    || defined(BSP_MCU_RX26T)) */

#if (!defined(BSP_MCU_RX64M) && !defined(BSP_MCU_RX65_ALL) && !defined(BSP_MCU_RX66T) \
    && !defined(BSP_MCU_RX71M) && !defined(BSP_MCU_RX72T) && !defined(BSP_MCU_RX72M) \
    && !defined(BSP_MCU_RX13T) && !defined(BSP_MCU_RX66N) && !defined(BSP_MCU_RX72N) \
    && !defined(BSP_MCU_RX23T) && !defined(BSP_MCU_RX24T) && !defined(BSP_MCU_RX24U) \
    && !defined(BSP_MCU_RX671) && !defined(BSP_MCU_RX660) && !defined(BSP_MCU_RX26T) \
    && !defined(BSP_MCU_RX14T))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi0_isr, VECT(S12AD,S12ADI0))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_gbadi_isr, VECT(S12AD,GBADI))

#endif

/**********************************************************************************************************************
 * Function Name: R_ADC_Open
 ******************************************************************************************************************//**
 * @brief This function initializes the 12-bit A/D converter. This function must be run before calling any other API
 * function.
 * @param[in] unit Unit number. Set this to 0 if your MCU supports only one unit.
 * @param[in] mode Operating mode.
 * @param[in] p_cfg Pointer to the configuration structure of the 12-bit A/D converter function.
 * @param[in] p_callback Optional pointer to function called from interrupt when a scan completes or a comparator
 * condition is met. When not using this parameter, set FIT_NO_PTR.
 * @retval ADC_SUCCESS Successful
 * @retval ADC_ERR_AD_LOCKED Open() call is in progress elsewhere
 * @retval ADC_ERR_AD_NOT_CLOSED Peripheral is still running in another mode; Perform R_ADC_Close() first
 * @retval ADC_ERR_INVALID_ARG Element of p_cfg structure has invalid value
 * @retval ADC_ERR_ILLEGAL_ARG an argument is illegal based upon mode
 * @retval ADC_ERR_MISSING_PTR p_cfg pointer is FIT_NO_PTR/NULL
 * @retval ADC_ERR_CONFIGURABLE_INT vector number of software configurable interrupt B is out of range
 * @details Applies power to the A/D peripheral, sets the operational mode, trigger sources, interrupt priority, and
 * configurations common to all channels and sensors. With a non-zero interrupt priority (interrupt usage), a callback
 * function is called by the interrupts whenever a scan has completed or a comparator condition is met. When setting
 * the interrupt priority to 0, a callback function is not called. In this case, poll for scan completion with the
 * R_ADC_Control() function when necessary. To set values of parameters used in this function, first clear all members
 * of parameters to 0, and then set values.
 * @note (RX Family Common):\n
 * Before calling the R_ADC_Open() function, set the vector number for the software configurable interrupt B
 * assigned to the unit to be used.
 * Refer to the User's Manual: Hardware about limitations of using output pins on the same port as analog pins.\n
 * The application must set the A/D conversion clock prior to calling R_ADC_Open() function.\n
 * To stop A/D conversion which is started in continuous scan mode, call the R_ADC_Close function.\n
 * If continuous scan mode is selected, it is recommended not to use the S12ADI interrupt since scan completion occurs
 * continuously. That causes the majority of the processing time to be spent at the interrupt level.\n
 * If interrupts are in use, a callback function is required which takes a single argument. This is a pointer to a
 * which is cast to a void pointer (provides consistency with other FIT module callback functions). Cast to the
 * structure adc_cb_args_t pointer in the interrupt handling.\n\n
 * (S12ADb, A12ADC, S12ADE, S12ADF, S12ADFa, S12ADH):\n
 *    After the R_ADC_Open() function is executed, wait at least 1 us before executing A/D conversion.
 */
adc_err_t R_ADC_Open( uint8_t const          unit,
                    adc_mode_t const        mode,
                    adc_cfg_t * const       p_cfg,
                    void         (* const  p_callback)(void *p_args))
{
    return adc_open(unit, mode, p_cfg, p_callback);
} /* End of function R_ADC_Open() */


/**********************************************************************************************************************
 * Function Name: R_ADC_Control
 ******************************************************************************************************************//**
 * @brief This function makes 12-bit A/D converter function settings and acquires the interrupt control and A/D
 * converter start/stop state.
 * @param[in] unit Unit number. Set this to 0 if your MCU supports only one unit.
 * @param[in] cmd Command to run.
 * @param[in] p_args Pointer to optional configuration structure. Clear all members of the argument to 0 before setting
 * values to them. If the command requires no argument, set FIT_NO_PTR.
 * @retval ADC_SUCCESS Successful
 * @retval ADC_ERR_MISSING_PTR p_args pointer is FIT_NO_PTR/NULL when required as an argument
 * @retval ADC_ERR_INVALID_ARG Invalid value is specified to p_args structure
 * @retval ADC_ERR_ILLEGAL_ARG cmd is illegal based upon mode
 * @retval ADC_ERR_SCAN_NOT_DONE The requested scan has not completed
 * @retval ADC_ERR_TRIG_ENABLED Cannot configure comparator because scan still running
 * @retval ADC_ERR_CONDITION_NOT_MET No channels/sensors met the comparison condition
 * @details Provides commands for enabling channels and sensors and for runtime operations. These include
 * enabling/disabling trigger sources and interrupts, initiating a software trigger, and checking for scan completion.
 * After the R_ADC_Open function is called, the commands can be issued by using the R_ADC_Control function.
 * See Section 3.2 in the application note for details.
 * @note (RX Family Common) \n
 * When the A/D conversion start (ADST) bit is 1, settings such as mode must not be changed
 * using this function. However, the conversion status or the comparison result can be obtained.\n
 * When switching channels used for A/D conversion or settings, call the R_ADC_Close() function once and then call the
 * R_ADC_Open() function again to start.\n
 * When waiting completion of A/D conversion using the R_ADC_Control function, use the commands.See Section
 * 3.2 in the application note for details.\n
 * When A/D conversion interrupts are enabled, the R_ADC_Control() function cannot be used to wait completion of
 * A/D conversion except when using single scan mode with software trigger. In this case, use the callback function for
 * the A/D conversion interrupt to wait completion of A/D conversion.\n\n
 * (S12ADF)\n
 * If Group A Priority is selected such that Group B operates in continuous scan mode, it is recommended not
 * to use the GBADI interrupt since the interrupt handling will be processed so often. That causes the majority of
 * the processing time to be spent at the interrupt level.\n\n
 * (S12ADC, S12ADFa)\n
 * Channels and sensors can be combined in the same unit.\n
 * ELC is only for S12ADI, not S12GBADI or S12CMPI. (S12ADC)\n
 * ELC is only for S12ADI, not GBADI, GCADI, S12CMPAI or S12CMPBI. (S12ADFa)\n
 * The application should wait 30 us after configuring the scan before enabling the trigger for Temperature Sensor
 * for best results.\n
 * If Group A Priority is selected such that Group B operates in continuous scan mode, it is recommended not to
 * use the S12GBADI interrupt (S12ADC) and GBADI interrupt (S12ADFa) since the interrupt handling will be processed
 * so often. That causes the majority of the processing time to be spent at the interrupt level.\n
 * Enabling the comparator should be done prior to enabling the triggers. Some features may not be used with others.
 * See Section 3.2 in the application note for details.\n\n
 * (S12ADE)\n
 * This function does not support following features.\n
 * Compare function window B\n
 * Compare function window A/B composite condition setting\n\n
 * (S12ADC, S12ADE, S12ADFa)\n
 * When using the comparison, configure the comparison after the channel configuration.\n\n
 * (S12ADb, S12ADFa, A12ADH)\n
 * For temperature sensor output and internal reference voltage, the number of
 * sampling states must be set as indicated below, at a minimum:\n
 * S12ADb, S12ADFa: 5 us\n
 * S12ADH: 4 us\n
 */
adc_err_t R_ADC_Control(uint8_t const       unit,
                        adc_cmd_t const     cmd,
                        void * const        p_args)
{
    return adc_control(unit, cmd, p_args);
} /* End of function R_ADC_Control() */


/**********************************************************************************************************************
 * Function Name: R_ADC_Read
 ******************************************************************************************************************//**
 * @brief This function reads conversion results from a single channel, sensor, double trigger, or self-diagnosis
 * register.
 * @param[in] unit Unit number. Set this to 0 if your MCU supports only one unit.
 * @param[in] reg_id ID of the register to read.
 * @param[in] p_data Pointer to variable to load value into.
 * @retval ADC_SUCCESS Success
 * @retval ADC_ERR_INVALID_ARG unit or reg_id contains an invalid value
 * @retval ADC_ERR_MISSING _PTR p_data is FIT_NO_PTR/NULL
 * @details Reads conversion results from a single channel, sensor, double trigger, or self-diagnosis register.
 * @note (S12ADb)\n
 * For temperature sensor output and internal reference voltage, discard the first A/D conversion
 * result after the open, and use the second and the subsequent A/D conversion results.
 */
adc_err_t R_ADC_Read(uint8_t            unit,
                    adc_reg_t const    reg_id,
                    uint16_t * const   p_data)
{
    dregs_t *p_dregs;

