HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/smc_gen/r_s12ad_rx/src/r_s12ad_rx.c
#if (defined(BSP_MCU_RX64M)   || defined(BSP_MCU_RX65_ALL) || defined(BSP_MCU_RX66T) \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72T)    || defined(BSP_MCU_RX72M) \
    || defined(BSP_MCU_RX66N) || defined(BSP_MCU_RX72N)    || defined(BSP_MCU_RX24T) \
    || defined(BSP_MCU_RX24U) || defined(BSP_MCU_RX671)    || defined(BSP_MCU_RX26T) \
    || defined(BSP_MCU_RX14T))
    p_dregs = ADC_PRV_GET_DATA_ARR(unit);
#else
    p_dregs = gp_dreg_ptrs;
#endif /* #if (defined(BSP_MCU_RX64M)   || defined(BSP_MCU_RX65_ALL) || defined(BSP_MCU_RX66T) \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72T)    || defined(BSP_MCU_RX72M) \
    || defined(BSP_MCU_RX66N) || defined(BSP_MCU_RX72N)    || defined(BSP_MCU_RX24T) \
    || defined(BSP_MCU_RX24U) || defined(BSP_MCU_RX671)    || defined(BSP_MCU_RX26T)) */

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    #if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65_ALL) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M) \
        || defined(BSP_MCU_RX66N) || defined(BSP_MCU_RX72N)  || defined(BSP_MCU_RX671) || defined(BSP_MCU_RX14T))
    if (unit > 1)
    {
        return ADC_ERR_INVALID_ARG;
    }
    #elif (defined(BSP_MCU_RX66T) || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX24T) \
        || defined(BSP_MCU_RX24U) || defined(BSP_MCU_RX26T))
    if (unit > 2)
    {
        return ADC_ERR_INVALID_ARG;
    }
    #endif

    /* Casting is valid because it matches the type to the right side or argument. */
    if ((NULL == p_data) || (FIT_NO_PTR == p_data))
    {
        return ADC_ERR_MISSING_PTR;
    }

    if (NULL == p_dregs[reg_id])
    {
        return ADC_ERR_INVALID_ARG;
    }

    /* Do not check if corresponding channel/sensor is enabled */
#endif

    *p_data = *p_dregs[reg_id];

    return ADC_SUCCESS;
} /* End of function R_ADC_Read() */

/**********************************************************************************************************************
 * Function Name: R_ADC_ReadAll
 ******************************************************************************************************************//**
 * @brief This function reads conversion results from all storage registers supported by the MCU.
 * @param[in] p_all_data Pointer to structure in which register values are loaded.
 * @retval ADC_SUCCESS Success
 * @retval ADC_ERR_MISSING_PTR p_data is FIT_NO_PTR/NULL
 * @details Reads conversion results from all potential sources, enabled or not.
 * @note None.
 */
adc_err_t R_ADC_ReadAll(adc_data_t * const  p_all_data)
{
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    /* Casting is valid because it matches the type to the right side or argument. */
    if ((NULL == p_all_data) || (FIT_NO_PTR == p_all_data))
    {
        return ADC_ERR_MISSING_PTR;
    }
#endif

#if (defined(BSP_MCU_RX64M)   || defined(BSP_MCU_RX65_ALL)|| defined(BSP_MCU_RX66T) \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M)   || defined(BSP_MCU_RX72T) \
    || defined(BSP_MCU_RX231) || defined(BSP_MCU_RX230)   || defined(BSP_MCU_RX23W) \
    || defined(BSP_MCU_RX130) || defined(BSP_MCU_RX13T)   || defined(BSP_MCU_RX66N) \
    || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX23E_A) || defined(BSP_MCU_RX23E_B) \
    || defined(BSP_MCU_RX23T) || defined(BSP_MCU_RX24T)   || defined(BSP_MCU_RX24U) \
    || defined(BSP_MCU_RX671) || defined(BSP_MCU_RX140)   || defined(BSP_MCU_RX660) \
    || defined(BSP_MCU_RX26T) || defined(BSP_MCU_RX260)   || defined(BSP_MCU_RX261) \
    || defined(BSP_MCU_RX14T))
    
    return adc_read_all(p_all_data);

#else /* rx110/rx111/rx113 */

    p_all_data->chan[ADC_REG_CH0] = S12AD.ADDR0;
    p_all_data->chan[ADC_REG_CH1] = S12AD.ADDR1;
    p_all_data->chan[ADC_REG_CH2] = S12AD.ADDR2;
    p_all_data->chan[ADC_REG_CH3] = S12AD.ADDR3;
    p_all_data->chan[ADC_REG_CH4] = S12AD.ADDR4;
    p_all_data->chan[ADC_REG_CH6] = S12AD.ADDR6;
    p_all_data->chan[ADC_REG_CH8] = S12AD.ADDR8;
    p_all_data->chan[ADC_REG_CH9] = S12AD.ADDR9;
    p_all_data->chan[ADC_REG_CH10] = S12AD.ADDR10;
    p_all_data->chan[ADC_REG_CH11] = S12AD.ADDR11;
    p_all_data->chan[ADC_REG_CH12] = S12AD.ADDR12;
    p_all_data->chan[ADC_REG_CH13] = S12AD.ADDR13;
    p_all_data->chan[ADC_REG_CH14] = S12AD.ADDR14;
    p_all_data->chan[ADC_REG_CH15] = S12AD.ADDR15;

#if (!defined(BSP_MCU_RX110) && !defined(BSP_MCU_RX111))
    p_all_data->chan[ADC_REG_CH5] = S12AD.ADDR5;
    p_all_data->chan[ADC_REG_CH7] = S12AD.ADDR7;
#endif
#ifdef BSP_MCU_RX113
    p_all_data->chan[ADC_REG_CH21] = S12AD.ADDR21;
#endif
    p_all_data->temp = S12AD.ADTSDR;
    p_all_data->volt = S12AD.ADOCDR;
    p_all_data->dbltrig = S12AD.ADDBLDR;

    return ADC_SUCCESS;

#endif /* #if (definedBSP_MCU_RX64M || definedBSP_MCU_RX65_ALL || definedBSP_MCU_RX66T \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M)   || defined(BSP_MCU_RX72T) \
    || defined(BSP_MCU_RX231) || defined(BSP_MCU_RX230)   || defined(BSP_MCU_RX23W) \
    || defined(BSP_MCU_RX130) || defined(BSP_MCU_RX13T)   || defined(BSP_MCU_RX66N) \
    || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX23E_A) || defined(BSP_MCU_RX23E_B) \
    || defined(BSP_MCU_RX23T) || defined(BSP_MCU_RX24T)   || defined(BSP_MCU_RX24U) \
    || defined(BSP_MCU_RX671) || defined(BSP_MCU_RX140)   || defined(BSP_MCU_RX660) \
    || defined(BSP_MCU_RX26T) || defined(BSP_MCU_RX260)   || defined(BSP_MCU_RX261)) */
    
} /* End of function R_ADC_ReadAll() */

/**********************************************************************************************************************
* Function Name: R_ADC_Close
 ******************************************************************************************************************//**
 * @brief This function ends any scan in progress, disables interrupts, and removes power to the A/D peripheral.
 * @param[in] unit Unit number. Set this to 0 if your MCU supports only one unit.
 * @retval ADC_SUCCESS Success
 * @retval ADC_ERR_INVALID_ARG unit contains an invalid value.
 * @details Ends the A/D conversion in progress, disables interrupts, and ends A/D converter operation. This function
 * can be called once per unit after the R_ADC_Open function is called.\n
 * When changing A/D conversion settings, call the R_ADC_Open() function again after this function is called.
 * @note This function will abort any scan that may be in progress.
 */
adc_err_t   R_ADC_Close(uint8_t const unit)
{
#if (defined(BSP_MCU_RX64M)   || defined(BSP_MCU_RX65_ALL) || defined(BSP_MCU_RX66T) \
    || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M)    || defined(BSP_MCU_RX72T) \
    || defined(BSP_MCU_RX231) || defined(BSP_MCU_RX230)    || defined(BSP_MCU_RX23W) \
    || defined(BSP_MCU_RX130) || defined(BSP_MCU_RX13T)    || defined(BSP_MCU_RX66N) \
    || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX23E_A)  || defined(BSP_MCU_RX23E_B) \
    || defined(BSP_MCU_RX23T) || defined(BSP_MCU_RX24T)    || defined(BSP_MCU_RX24U) \
    || defined(BSP_MCU_RX671) || defined(BSP_MCU_RX140)    || defined(BSP_MCU_RX660) \
    || defined(BSP_MCU_RX26T) || defined(BSP_MCU_RX260)    || defined(BSP_MCU_RX261) \
    || defined(BSP_MCU_RX14T))

    return adc_close(unit);

#else /* rx110/rx111/rx113 */
    volatile uint16_t i;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (unit > 0)
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif

    /* Stop triggers & conversions, and disable peripheral interrupts */
    R_BSP_InterruptRequestDisable(VECT(S12AD,S12ADI0));         // disable interrupts in ICU
    IR(S12AD,S12ADI0) = 0;          // clear interrupt flag
    R_BSP_InterruptRequestDisable(VECT(S12AD,GBADI));           // disable interrupts in ICU
    IR(S12AD,GBADI) = 0;            // clear interrupt flag
    S12AD.ADCSR.BIT.TRGE = 0;
    S12AD.ADCSR.WORD = 0;

    /* Wait for 2 ADCLK cycles (MAX: 128 ICLK cycles) */
    /* WAIT_LOOP */
    for (i = 0; i < 128; i++)
    {
        R_BSP_NOP();
    }

    /* Power down peripheral */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#ifndef BSP_MCU_RX11_ALL             // RX63x
    if (g_dcb.mode == ADC_MODE_SS_TEMPERATURE)
    {
        TEMPS.TSCR.BYTE = 0;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        MSTP(TEMPS) = 1;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    }
#endif
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    MSTP(S12AD) = 1;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

